import React from 'react'
import CoursesCart from '../components/CoursesCart'
import '../style/Courses.css'

import img1 from '../assets/syllabus.jpg'
import img2 from '../assets/liberary.jpg'
import img3 from '../assets/RRw.png'
import img4 from '../assets/nss.jpeg'

const data = [
  {
    image:img1,
    heading:'पाठ्येत्तरकार्यक्रम',
    content:'स्वतंत्रचिंतन, कलात्मकरूचि, लेखन- पटुता, वाक्शक्ति, चारित्रिकदृढ़ता, नागरिकता एवं नेतृत्व जैसे गुणों के विकास के लिए विभिन्न परिषदों का गठन किया गया है, जिनके तत्वाधान में समय - समय पर सांस्कृतिक, साहित्यिक एवं सामाजिक समारोह आयोजित होते रहते हैं | ये परिषदें प्राध्यापकों के मार्ग दर्शन में विद्यार्थियों द्वारा संचालित की जाती हैं | इनमे भाग लेने वाले प्रतिभावान छात्र सभी प्रकार से प्रोत्साहित व पुरष्कृत किये जाते हैं i'
  },
  {
    image:img2,
    heading:'पुस्तकालयएवं वाचनालय',
    content:'पुस्तकालय में प्रत्येक विषय की पर्याप्त संख्या में पुस्तकें संग्रहीत हैं | विद्यार्थियों से आशा की जाती हैं की ये उनका अधिकाधिक उपयोग करेंगे I महाविद्यालय में अध्ययनरत छात्रों के लिए बहुमूल्य संदर्भ ग्रंथ पुस्तकालय में उपलब्ध है तथा वाचनालय में विभिन्न विषयों की पत्र - पत्रिकाएं भी उपलब्ध हैं | पुस्तकालय से केवल दो पुस्तक १५ दिन के लिए दीजाएगी I इसके पश्चात्निर्धारित अर्थदंड प्रतिदिन के हिसाब से देना होगा| मेधावी तथा जिज्ञासु छात्रों के लिए पुस्तकालय में बैठकर भी अध्ययन करने की सुविधा है I'
  },
  {
    image:img3,
    heading:'एन.एस.एस. एवंरोवर्सरेंजर्',
    content:'महाविद्यालय में फुटबाल , क्रिकेट,बालीबाल,हाँकी,बैडमिंटन,टेबुलटेनिस,बास्केटबाल, कबड्डी, एथलेटिक्स आदि खेलों की समुचित व्यवस्था है, जिसके लिए सुदक्ष शारीरिक - शिक्षा - शिक्षकों की नियुक्ति की गयी है I (ब) एन.एस. एस.एवं रोवर्सरेंजर्स की व्यवस्था उपलब्ध हैं I'
  },
  {
    image:img4,
    heading:'एन.एस.एस.',
    content:'महाविद्यालयको ५० छात्रों की एक इकाई प्राप्त है जिसमे बी.ए. (शास्त्री) प्रथमवर्ष एवं बी.ए. (शास्त्री) दृतीय वर्ष के १०० छात्रों की उपस्थिति के आधार पर प्रवेश दिया जायेगा ,जिसका लाभ उन्हें आगामी प्रवेश परीक्षाओं में प्राप्त होगा I'
  }
]

const Contact = () => {
  return (
    <>
           <div className="courses_m_con">
              <div className="heading_cours">
                <h1 className="heading_c_h1">
                    Our Courses
                </h1>
                <div style={{width:'67%',position:'relative',bottom:'.4rem',left:'.5rem'}} id="underline_"></div>
              </div>

            <div className="course_data">
               { data.map((e,i)=>  
                         (
                          <CoursesCart
                            image={e.image}
                            heading={e.heading}
                            content={e.content}
                            key={i}
                          />
                        )
                    )
                 }
            </div>
                 
  
            </div>
    </>
  )
}

export default Contact